# Challenge Questions - TfL Dataset

#

## Import pandas, numpy and datetime

In [1]:
import pandas as pd
import numpy as np

In [2]:
import datetime as dt

## Load the files:
• "tfl-daily-cycle-hires.csv" should be assigned to the variable **tfl**

In [3]:
tfl=pd.read_csv('tfl-daily-cycle-hires.csv')

In [28]:
tfl

             Day  Number of Bicycle Hires
0     30/07/2010                   6897.0
1     31/07/2010                   5564.0
2     01/08/2010                   4303.0
3     02/08/2010                   6642.0
4     03/08/2010                   7966.0
...          ...                      ...
4076  26/09/2021                  45120.0
4077  27/09/2021                  32167.0
4078  28/09/2021                  32539.0
4079  29/09/2021                  39889.0
4080  30/09/2021                  34070.0

[4081 rows x 2 columns]

## Check the head of the DataFrame

In [6]:
tfl.head()

          Day  Number of Bicycle Hires  Unnamed: 2
0  30/07/2010                   6897.0         NaN
1  31/07/2010                   5564.0         NaN
2  01/08/2010                   4303.0         NaN
3  02/08/2010                   6642.0         NaN
4  03/08/2010                   7966.0         NaN

## Check the data types of the DataFrame columns

In [13]:
tfl[['Day', 'Number of Bicycle Hires', 'Unnamed: 2']].dtypes

Day                         object
Number of Bicycle Hires    float64
Unnamed: 2                 float64
dtype: object

In [14]:
tfl.dtypes

Day                         object
Number of Bicycle Hires    float64
Unnamed: 2                 float64
dtype: object

## Change the data types and remove unnecessary columns 

• 'Day' should be a datetime64 data type

• 'Number of Bicycle Hires' should be float64

• Any other columns should be deleted

In [27]:
tfl.drop(columns='Unnamed: 2', axis=0, inplace=True)

             Day  Number of Bicycle Hires
0     30/07/2010                   6897.0
1     31/07/2010                   5564.0
2     01/08/2010                   4303.0
3     02/08/2010                   6642.0
4     03/08/2010                   7966.0
...          ...                      ...
4076  26/09/2021                  45120.0
4077  27/09/2021                  32167.0
4078  28/09/2021                  32539.0
4079  29/09/2021                  39889.0
4080  30/09/2021                  34070.0

[4081 rows x 2 columns]

In [38]:
tfl['Day']=pd.to_datetime(tfl['Day'], format='%d/%m/%y')

In [40]:
tfl['Number of Bicycle Hires'].astype(float)

0        6897.0
1        5564.0
2        4303.0
3        6642.0
4        7966.0
         ...
4076    45120.0
4077    32167.0
4078    32539.0
4079    39889.0
4080    34070.0
Name: Number of Bicycle Hires, Length: 4081, dtype: float64

In [42]:
tfl.dtypes

Day                        datetime64[ns]
Number of Bicycle Hires           float64
dtype: object

## What is the average number of bicycle hires per day across the entire dataset?

In [51]:
tfl['Number of Bicycle Hires'].mean()

26261.932124479295

In [50]:
round(tfl['Number of Bicycle Hires'].mean(),2)

26261.93

## Create a new column called 'Year' which contains the 4 digit year

In [62]:
tfl['year']=tfl['Day'].dt.strftime('%y')

In [63]:
tfl.head()

         Day  Number of Bicycle Hires year
0 2010-07-30                   6897.0   10
1 2010-07-31                   5564.0   10
2 2010-08-01                   4303.0   10
3 2010-08-02                   6642.0   10
4 2010-08-03                   7966.0   10

## What is the average number of bicycle hires per Year across the entire dataset

In [67]:
tfl.groupby(by='year').mean('Number of Bicycle Hires')

      Number of Bicycle Hires
year
10               14069.761290
11               19568.353425
12               26008.969945
13               22042.353425
14               27462.731507
15               27046.134247
16               28152.013661
17               28619.298630
18               28952.164384
19               28561.520548
20               28508.653005
21               30091.069597

## What is the total number of bicycle hires per Year across the entire dataset

In [69]:
tfl.groupby(by='year').sum('Number of Bicycle Hires')

      Number of Bicycle Hires
year
10                  2180813.0
11                  7142449.0
12                  9519283.0
13                  8045459.0
14                 10023897.0
15                  9871839.0
16                 10303637.0
17                 10446044.0
18                 10567540.0
19                 10424955.0
20                 10434167.0
21                  8214862.0

## Create a new column called 'Category' on the tfl DataFrame that classifies the number of bike hires per day as:
* 'Low' if the 'Number of Bicycle Hires' is below 10,000
* 'Medium' if the 'Number of Bicycle Hires' is below 40,000 but greater than or equal to 10,000
* 'High' if the 'Number of Bicycle Hires' is greater than or equal to 40,000

In [85]:
def tfl_func(x):
    if x>=40000:
        return 'High'
    elif x>=10000:
         return 'Medium'
    else:
        return 'Low'

In [101]:
tfl['Category']=tfl['Number of Bicycle Hires'].apply(tfl_func)

In [102]:
tfl

            Day  Number of Bicycle Hires year Category
0    2010-07-30                   6897.0   10      Low
1    2010-07-31                   5564.0   10      Low
2    2010-08-01                   4303.0   10      Low
3    2010-08-02                   6642.0   10      Low
4    2010-08-03                   7966.0   10      Low
...         ...                      ...  ...      ...
4076 2021-09-26                  45120.0   21     High
4077 2021-09-27                  32167.0   21   Medium
4078 2021-09-28                  32539.0   21   Medium
4079 2021-09-29                  39889.0   21   Medium
4080 2021-09-30                  34070.0   21   Medium

[4081 rows x 4 columns]

## For each year in the tfl DataFrame how many days are classed as 'Low', 'Medium' or 'High'?

In [108]:
pd.pivot_table(data=tfl,index='year',columns='Category',values='Day', fill_value='0', aggfunc='count')

Category  High  Low  Medium
year
10           0   44     111
11           0   30     335
12        27.0   19     320
13           0   25     340
14        27.0   10     328
15        12.0    9     344
16        37.0    6     323
17        28.0   13     324
18        52.0   16     297
19        20.0    3     342
20        63.0   11     292
21        62.0    9     202

# Another option

In [113]:
tfl.groupby(by=['year','Category']).count()['Day']

year  Category
10    Low          44
      Medium      111
11    Low          30
      Medium      335
12    High         27
      Low          19
      Medium      320
13    Low          25
      Medium      340
14    High         27
      Low          10
      Medium      328
15    High         12
      Low           9
      Medium      344
16    High         37
      Low           6
      Medium      323
17    High         28
      Low          13
      Medium      324
18    High         52
      Low          16
      Medium      297
19    High         20
      Low           3
      Medium      342
20    High         63
      Low          11
      Medium      292
21    High         62
      Low           9
      Medium      202
Name: Day, dtype: int64